loadtest.yaml
config:
  http:
    defaults:
      headers:
        content-type: 'application/json'
  target: 'http://hello-world.example'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
scenarios:
  - flow:
      - loop:
          - post:
              url: '/graphql'
              json:
                query: |
                  query Query {
                    user(username: "testuser1") {
                      id
                    }
                  }
          - post:
              url: '/graphql'
              json:
                query: |
                  query Query {
                    user(username: "testuser2") {
                      id
                    }
                  }
          - post:
              url: '/graphql'
              json:
                query: |
                  query BooksQuery {
                    allBooks {
                      _id
                      content
                      author {
                        id
                        username
                      }
                    }
                  }
        count: 10